# OccupancyUnit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..OccupancyUnit Property
Space Class See Also
---
Get or set the Occupancy Unit of the Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public OccupancyUnit OccupancyUnit { get; set; }
```

Visual Basic
---
```text
Public Property OccupancyUnit As OccupancyUnit
	Get
	Set
```

Visual C++
---
```text
public:
property OccupancyUnit OccupancyUnit {
	OccupancyUnit get ();
	void set (OccupancyUnit value);
}
```

# Remarks
This property is used to get or set the Occupancy Unit of the Space.
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace